Revit 2027 API
ParameterTypeId.SheetPrimaryTitleBlock Property
 "Primary Title Block"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SheetPrimaryTitleBlock { get; }
Public Shared ReadOnly Property SheetPrimaryTitleBlock As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SheetPrimaryTitleBlock {
	ForgeTypeId^ get ();
}
static member SheetPrimaryTitleBlock : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace